# 用户表
CREATE TABLE user (
  id       INT AUTO_INCREMENT PRIMARY KEY,
  userName VARCHAR(50) NOT NULL,
  password VARCHAR(50) NOT NULL
)
  DEFAULT CHARSET = utf8;


# 景点信息表
CREATE TABLE `points` (
  `name`        VARCHAR(20) NOT NULL DEFAULT '',
  `location`    POINT       NOT NULL,
  `description` LONGTEXT    NOT NULL,
  `height`      DOUBLE      NOT NULL,
  PRIMARY KEY (`name`),
  SPATIAL KEY `sp_index` (`location`)
)
  ENGINE = MyISAM
  DEFAULT CHARSET = utf8;

# 插入数据
INSERT INTO points VALUES ('黄龙峡', Point(115.958101, 29.553139), '', 800);
INSERT INTO points VALUES ('北斗星宾馆', Point(115.983222, 29.567214), '', 1149.20);
INSERT INTO points VALUES ('汉口峡', Point(115.985197, 29.565647), '', 1149.20);
INSERT INTO points VALUES ('大月山水库', Point(115.984919, 29.564467),
                           '大月山水库位于大月山上,海拔1200米的位置,水库为人工挖建形成，受人为因素的干扰小，是由纯天然降水汇聚而成，是庐山2万常住居民及数万名游客的生活用水来源之一。', 1252.00);
INSERT INTO points VALUES ('大月山', Point(115.985164, 29.562014), '', 1295.70);
INSERT INTO points VALUES ('望江亭', Point(115.984989, 29.579517), '', 1089.07);
INSERT INTO points VALUES ('半山亭', Point(115.984739, 29.585767), '', 930.30);
INSERT INTO points VALUES ('王家坡裁缝岭', Point(116.000211, 29.582661), '', 887.45);
INSERT INTO points VALUES ('如琴湖大坎', Point(115.964497, 29.568772), '', 1014.61);
INSERT INTO points VALUES ('佛手崖', Point(115.956764, 29.564211), '', 956.50);
INSERT INTO points VALUES ('仙人洞口', Point(115.949842, 29.559025),
                           '毛泽东主席有词赞曰“天生一个仙人洞,无限风光在险峰”。仙人洞，位于庐山天池山西麓。是一个由砂崖构成的岩石洞。由于大自然的不断风化和山水长期冲刷，慢慢形成天然洞窟。因其形似佛手，故名佛手岩。进口处，为一圆形石门。门上方正中镌刻“仙人洞”三字 。 在佛手岩的覆盖下，一洞中开为仙人洞。洞高、深各约 10 米，幽深处有清泉下滴，称“一滴泉”。洞壁有“洞天玉液”等石刻题词。洞中央“纯阳殿”内置吕洞宾石像，相传八仙中的剑仙——吕洞宾在此修道成仙，后人为奉祠吕洞宾，将佛手岩更名为仙人洞。每当云雾缭绕之时，骤添几分仙气，颇有远离尘世的感觉。',
                           803.70);
INSERT INTO points VALUES ('庐山大厦', Point(115.972375, 29.561708),
                           '建成于1936年，原国民党中央党部“传习学舍“，庐山建筑代表作之一。占地1800平方米，建筑面积9220平方米，是中国名山上体量最大、最高的建筑。前面的大半部为四层，连接的后半部为三层，在它对面的山上眺望，整体似六层。它前面建造了四层台阶。第一层平台之中有个用望柱、雕栏围护的鱼池，并辅以望柱、栏杆等，形成几个建筑间的交汇点，从而丰富了台阶的层次感。运用了较多的现代建筑手法,用钢筋水泥筑成,但仍然表现出明显的中国气息。',
                           992.35);
INSERT INTO points VALUES ('回龙路', Point(115.968342, 29.559544), '', 965.28);
INSERT INTO points VALUES ('芦林大桥', Point(115.967894, 29.552786),
                           '此处高峡出平湖，青山绿水，山色倒影，相映成趣。为庐山添一胜景。大坝高32米，长120米，宽12米，大坝体积达3万立方米，系用石块和水泥混交筑成，雄伟宽坦。芦林桥建于芦林湖大坝坝面，大桥桥身上段有5个桥孔，溢洪时，五孔喷流，似五条龙飞吼而下，成为壮丽的人工瀑布。',
                           991.00);
INSERT INTO points VALUES ('黄龙寺', Point(115.967681, 29.558422), '黄龙寺处在万山环抱的山谷之中，松林茂密，前有天王峰，侧有黄龙谭。此寺庙相传是明代彻空禅师所建，以前有叫“鹿野禅林”，据《庐山志》记载：“寺踞庐山之中，以黄龙潭得名也”。其实黄龙寺是佛教临济宗分支黄龙派，寺因所奉佛教宗派得名。
1986年黄龙寺复建，1987年，黄龙寺被列为江西省重点开发寺院。1997年在旧有的黄龙寺前新建大雄宝殿，建筑面积约380平方米，大殿内供西方三圣，两边供十八罗汉，匾额为彭冲所书。
相传早在晋代，释昙诜在此修持，并栽下2株婆娑宝树、1株银杏。即是今日所见的三宝树。', 967.89);
INSERT INTO points VALUES ('白鹿洞', Point(116.037644, 29.525714),
                           '白鹿洞位于白鹿洞书院后面，据《厦门志》记载：“白鹿洞左右多崩崖立石，中有亭树掩映，旧建有大观楼、宛在洞、接因亭。白鹿洞在唐代时原为诗人李渤兄弟隐居读书的地方，李渤当时养白鹿自娱，传说该鹿通晓人性，能跋涉数十里到星子县城为主人购买书、纸、笔、墨，李渤遂有外号“白鹿先生”。后来他出任江州刺史，于此修楼建亭，取名白鹿洞。白居易过江州，赠李渤一诗中，即有“君家白鹿洞，闻道亦生苔”之句。洞中伏着一双泥塑白鹿，常有白烟涌出，看起来宛若“白鹿含烟”。',
                           197.32);
INSERT INTO points VALUES ('白鹿洞秀峰', Point(115.985147, 29.466792), '', -12.10);
INSERT INTO points VALUES ('九江98抗', Point(115.933889, 29.601667), '', 25.00);
